# Задайте 2 числа, найдите наименьшее общее кратное этих двух чисел
import math


a = int(input())
b = int(input())
print(a*b//math.gcd(a, b))


# 1. модуль decimal
# 3. set
# 4. если 0, пропускаем, но счет продолжается. список, знаки разные choices
# 5. второй файл, количество строк в файле должно быть равно
